1、在此系统中，C语言源程序的扩展名是（  .c ）。
2、以下用户标识符中，合法的是（  nit ）。
3、以下不正确的赋值语句是。（  a= =b; ）
4、下列说法正确的是（ 无论注释内容多少，在对程序编译时都被忽略 ）。
5、以下叙述中正确的是（ C程序书写格式自由，一个语句可以写在多行上  ）。
6、以下叙述中不正确的是（关键字用户也是可以命名的
7、 设整型变量s,t,c1,c2,c3,c4的值均为2，则执行语句（s=c1==c2）||(t=c3>c4)后，s,t的值为：（  1，2   ）。 
8、C语言程序编译时，程序中的注释部分，不参加编译，也不会出现在目标程序中 
9、语句for（a=0，b=0;b！=100&&a<5;a++）scanf(“%d”,&b); scanf最多可执行次数为（  5  ） 。
10、C语言允许函数值类型缺省定义，此时该函数值默认的类型是。（  int型  ）
11、以下关于long、int和short类型数据占用内存大小的叙述中正确的是（  由C语言编译系统决定 ）。
12、数字字符0的ASCII值为48，以下程序的输出结果是（   ）。
#include <stdio.h>
void main ()
{
	char  a=’1’, b=’2’;
	printf ("%c, ”,b);
		printf (“%d\n",b-a);
}
A. 3, 1        B. 50, 1       C. 2, 1        D. 2, 49
13、设有int x,y;以下语句判断x和y是否相等，正确的说法是（ 不能判断x和y是否相等  ）。
if(x=y) printf(“x is aqual to y.”)
	14、在VC编译系统中，经下列语句“char x=65; float y=7.3; int a=100; double b=4.5;” 定义后，sizeof(x)、sizeof(y)、sizeof(a)、sizeof(b)的值分别是（  1, 4, 4, 8    ）。
15、若有int a[3][5]={2，2}，{2，6}，{2，6，2}}，则数组a共有（ 15 ）个元素。 
16、C程序的3种基本结构是（顺序结构、选择结构、循环结
）。
17、若变量已定义为int类型，要给a、b、c输入数据，以下正确的输入语句是（ scanf("%d%d%d",&a,&b,&c);  ）。
18、对于for（s=2;  ;s++）可以理解为：（ for（s=2；1 ；s++）  ） 
	20、若变量c为char类型，能正确判断出c为小写字母的表达式是（  (c>=‘a’) && (c<=’z’) ）。
	21、若int x=1, y=1;，则表达式(!x || y--)的值是（ 1 ）。
22、有以下程序段
int k=0
while(k=1) k++；
	while 循环执行的次数是有语法错，不能执行   
		24、以下if语句错误的是。（  if(x<y) x++;y++;else x--;y--; ）
25、下列哪个变量名是正确的？（ p_11  ）
A. p_11           B. -p11           C. int         D. a.b
26、在C语言中，if语句嵌套时，if与else的配对关系是（ 每个else总是与它上面最近的if配对 ）。
27、以下选项正确的是（  #define N 100  ）。
A.int num[ ];                        B.#define N 100
C.int num[0···100];                 D.int num[10];                             28、以下不能对二维数组a进行正确初始化的语句是（    ）。
A.int a[2][3] = {0};                 B.int a[ ][3] = { {1,2}, {0} };
C.int a[2][3] = { {1,2}, {3,4}, {5,6} };        
D.int a[ ][3] = { 1, 2, 3, 4, 5, 6 };
30、设：char s[10]={“october”}；则printf（“%d\n”，strlen（s））；输出是：（ 7  ） 
31、C语言中，数据文件的存取方式是。（   ）
A.只能顺序存取                      B.只能直接存取    
C.可以顺序存取和随机存取            D.只能从文件的开头进行存取
32、C语言程序是从main函数开始执行的，这个函数写在（  程序文件的任何位置 ）。
33、以下函数的正确定义形式是。（   ）
A. double fun(int x, int y)             B. double fun(int x;int y)
C. double fun(int x  int y);            D. double fun(int x,y);
34、下列符号中用来表示C语言中的回车换行的是。（ \n  ）
35、以下能正确定义一维数组的是。（   ）
A．int arr[5] = {0,1,2,3,4,5};          B．int arr[5] = “012345”;
C．char arr[ ] = “012345”;            D．char arr[5] = {0,1,2,3,4,5};
36、以下函数的正确定义形式是。（   ）
A．read（a,b,c）;                   B．scanf(“%d%d%d”,a,b,c);      
C．scanf(“%D%D%D”,a,b,c);         D．scanf(“%d%d%d”,&a,&b,&c);
37、C语言中主函数的个数是。（ 1个  ）
38、下面可能不影响程序正常运行的是。（ 警告提示  ）
39、对do…while语句错误的描述是。（ 循环次数可能为0    ）
40、下列哪个变量名是正确的？（  _f5  ）
B、	41、Break语句的正确的用法是（  在多重循环中，只能退出最靠近的那一层循环语句。
42、设有定义：int x=1,*p=&x;则语句printf(“%d\n”,*p);的输出结果是。（ 1  ）
43、sizeof(double)的结果值是（  8 ）
44、关于数组的定义与初始化，下列哪一项是错误的？（   ）
A．int arr[5] = {1,2,3,4,5};           B．int arr[] = {1,2,3,4,5};
C．int arr[5] = {1,2,3};               D．int arr[5] = {1,2,3,4,5,6};
45、C 语言程序的注释是（ 由“/*”开头，“*/”结尾   ）。
46、若x=5,y=4 则y*=x+5; y的值为( 40  ).
47、以下选项哪个是C语言中的包含头文件写法（ #include<stdio.h>   ）
48、以下（     ）是不正确的描述。
A、不论在主函数还是自定义函数中，只要说明了变量，就可为其分配存贮单元。
49、表达式“1？(0？3：2)：（10？1：0）”的值为（  2  ）
50、为表示关系x≥y≥z，应使用C语言表达式（ （x>=y）&&(y>=z)   ）
51、设有说明int s[5]={1,3,5,7,9}; int *p=s; 则下列表达式中值为3的是。（ *(++p)  ）
52、若有char h=`a`，g=`f`；int a[6]={1，2，3，4，5，6}；则数值为4的表达式为：（ a[`h`-`e`]  ） 
53、设int a=5，b，*p=&a,则使b不等于5的语句为:（  b=*a ） 
54、若有int a[7]={1,2,3,4,5,6,7}，*p=a则不能表示数组元素的表达式是:（  a[7] ） 
55、两个指针变量的值相等时，表明两个指针变量是（指向同一内存单元地址或者都为空）
56、字符串指针变量中存入的是（  字符串的首地址  ）
二、填空题
1、设char string[] =″This_is_a_book!″；则数组的长度应是 16  。
2、开发一个C程序要经过  编辑  、  编译  、  连接  、  运行  4个步骤。
3、一个C程序总是从    main()     开始执行。
4、一个C语言程序有且只有  1  个主函数。
5、开发一个C程序要经过编辑、编译、 连接 和运行四个步骤。
6、’a’在内存中占   1   个字节，“a”在内存中占   2   个字节。
7、在C程序中，若未在函数定义时说明函数类型，则函数默认的类型为 int 。
8、若int k=11;，则运算k++后表达式的值为   11   ，变量的值为   12   。
9、设int i = 5；则循环语句while (i > = 1) i - -;执行后，i的值为  0  。
10、若已定义x和y为double类型，则表达式x=1，y=x+3/2的值是  2.500000 。
11、若double x;，则运算“x=2.1, ++x”后表达式的值为  3.100000  ，变量的值为  3.100000  。
12、在C语言程序中，用关键字 int 定义基本整型变量，用关键字 float定义单精度实型变量，用关键字 double 定义双精度实型变量，用关键字 char定义字符型变量。
17、若有以下程序段:
	int i=0,a=1; 
	for(i=1;i<10;i++)a++;
	该循环条件将执行 9 次。
	18、C语句必须以  分号 结束。
	19、一个C语言文件是由若干个 函数  组成。
	20、能表述“20<x<30或x<-100”的C语言表达式是  (x>20 && x<30) || x<-100  。
	21、设有数组定义：char a [ ]="China"; 则数组 a所占的空间为 6 个字节。
	22、用{ }把一些语句括起来称为   复合   语句。
	23、若有以下程序段:
		int c1=1,c2=2,c3; 
		c3=1.0/c2*c1; 
		则执行后，c3中的值是  0  。
		24、设int a=1,b=2,c,d,e;执行c=(-a++)+(++b);d=(b--)+(++a)-a;e=(a/(++b))-(a/(--a));后，请问a的结果是：   2   。
		25、C语言中，一个函数由两部分来组成,他们是 函数头 、  函数体 。
		26、下列程序是从键盘输入一个整数，先求绝对值，然后求其平方根，并输出两次计算结果，将程序补充完整。
#include <stdio.h>
#include <_math.h_>
		main()
		{
			_int x,f1;_
			float f2;
			printf(“enter a interger:”);
			scanf(“%d”,&x);
			f1=__ abs(x)_____;
			f2=__ sqrt(f1)___;
			printf(“%d,%f”,f1,f2);
		}
		27、使用函数调用的方法求n！，请将程序填写完整。
		int fact(  int  n  )    
		{ 
			int i,  f=1  ;
			for(i=1;i<=n;i++)
				f=f*i  ;
			return f;
		}
		main()
		{ 
			int n,t  ;
			scanf("%d",&n);
			t= fact(n);
			printf("%d\n",t); }
		三、判断题
		（ √ ）1.C语句必须以分号结束。 
		（ √ ）2.一个源程序必须包含一个main函数。
		（ √ ）3.C语言有三种结构化程序设计方法，分别为顺序结构、选择结构和循环结构。 
		（ × ）4.数组在定义时没有必要指定数组的长度，其长度可以在程序中根据元素个数再决定。
		（ √ ）5.在C语言中do-while至少执行1次循环。
		（ √ ）6.main函数可以放在C程序的中间部分，但在执行C程序时是从main函数开始的。
		（ × ）7.在VC6.0环境中用RUN命令运行一个C程序时，这时所运行的程序的后缀是.c。
		（ × ）8.C语言规定标识符的大小写字母没有区别。
		（ × ）9.函数putchar()的作用是：输入一个字符。
		（ × ）10.函数定义中的形参可以是常量、变量或表达式。
		（ √ ）11.C语言中的逻辑值“真”是用1表示的，逻辑值“假”是用0表示的。
		（ × ）12.C语言程序编译时，程序中的注释部分参加编译，但不会出现在目标程序中。
		（ × ）13.字符串是C语言中一种基本数据类型，字符串总是以‘\n’作为结束标志。
		（ × ）14.算术运算符中‘%’的优先级高于‘*’。
		（ √ ）15.一个C程序的执行是从本程序的main()函数开始,到main函数结束。
		（ × ）16. 函数参数传递分为值传递和内容传递。
		（ × ）17. int a[10]；该语句表明数组a中的第十个元素为a[10]。
		（ √ ）18. 在C语言中，包含头文件的预处理命令以#include开头。
		（ √ ）19. for语句作为循环控制语句时，从语法上其括号内各个表达式都可缺省，但表达式内的分号却不可省。
		（ × ）20. 若定义的函数没有参数，则函数名后的圆括号可以省略。
		（ × ）21.在函数调用中将数组名字作为实参时，实现的是单向的值传递。
		（ × ）22.if语句有多种使用方法，其中if子句和else子句也都可以单独使用。
		（ × ）23.所谓常量，就是在程序运行过程中其值可以改变的量。
		（ × ）24若int i=10,j=2;则执行i*=j+8;后i的值为28。
		（ √ ）25.函数的实参和形参可以是相同的名字。
		（ × ）26.在定义数组时数组元素的个数可以是不确定的。
		（ √ ）27.break语句在switch语句中也可以使用。
		
		四、程序设计题 
		1、由键盘输入圆的半径R，输出该圆的周长（2πR），其中π=3.14159。
		代码
#include <stdio.h>
		main()
		{
			int R;
			float c;
			printf("请输入圆的半径：");
			scanf("%d",&R);
			c=2*3.14159*R;
			printf("周长为：%.2f\n",c);
		}
		2、定义一个求最大值的函数，从键盘输入两个整数，调用该函数，输出其中的最大值。
		代码：
#include <stdio.h>
		void main( )
		{
			int max(int x,int y);
			int a,b,c;
			scanf("%d%d",&a,&b);
			c=max(a,b);
			printf("最大值是%d\n",c);
		}
		int max(int x,int y)
		{
			int z;
			if(x>y)
				z=x;
			else
				z=y;
			return z; 
		} 
		
		3、编写一个C程序，求1+2!+3!+...+20!的值。
		代码：
#include <stdio.h>
		void main()
		{
			int i;
			double index=1,sum=0;
			for(i=1;i<=20;i++)
			{
				index*=i;
				sum+=index; 
			}
			printf("%e\n",sum);
		}
		4、定义一个求和函数，从键盘输入两个整数，调用该函数，输出其和值。
		代码：
#include <stdio.h>
		void main()
		{
			int sum(int x,int y);
			int a,b,s;
			scanf("%d%d",&a,&b);
			s=sum(a,b);
			printf("两者之和是%d\n",s);
		}
		int sum(int x,int y)
		{
			int z;
			z=x+y;
			return z; 
		}
		
		5、用随机函数产生20个1-100之间的整数，并放入一个一维数组中，然后将其前10个元素与后10个元素对换，即：第1个元素与第20个元素互换，第2个元素与第19个元素互换…… 分别输出数组原来的值和对换后各元素的值，输出数据之间用空格隔开。
		代码：
#include <stdio.h>
#include <stdlib.h>
		void main()
		{
			int a[20],i,temp;
			for(i=0;i<20;i++)
				a[i]=rand()%100;
			printf("数组原来的值是：\n");
			for(i=0;i<20;i++)
				printf("%d  ",a[i]);
			printf("\n");
			for(i=0;i<10;i++)
			{
				temp=a[i];
				a[i]=a[19-i];
				a[19-i]=temp;
			}
			printf("对换后各元素的值是：\n");
			for(i=0;i<20;i++)
				printf("%d  ",a[i]);
			printf("\n");
		}
		6、请编写一个C程序，利用循环和选择结构语句，输出1-50中的偶数，并求其最终的和值，输出数据之间用空格隔开。
		代码：
#include <stdio.h>
		void main()
		{
			int i,sum=0;
			for(i=1; i<=50; i++)
			{
				if(i%2 == 0)
				{
					sum+=i;
					printf("%d  ",i);
				}
			}
			printf("\n最终的和是%d",sum);
			printf("\n");
		}
		7、从键盘上输入10个整数，并放入一个一维数组中，然后将其前5个元素与后5个元素对换，即：第1个元素与第10个元素互换，第2个元素与第9个元素互换……分别输出数组原来的值和对换后各元素的值，输出数据之间用空格隔开。
		代码：
#include <stdio.h>
		void main( )
		{
			int a[10],i,temp;
			for(i=0;i<10;i++)
				scanf("%d",&a[i]);
			printf("数组原来的值是：\n");
			for(i=0;i<10;i++)
				printf("%d  ",a[i]);
			printf("\n");
			for(i=0;i<5;i++)
			{
				temp=a[i];
				a[i]=a[9-i];
				a[9-i]=temp;
			}
			printf("对换后各元素的值是：\n");
			for(i=0;i<10;i++)
				printf("%d  ",a[i]);
			printf("\n");
		}
		
		8、设计一个一维数组，内放10个学生成绩，求其平均成绩(采用函数设计的方法)。
		代码：
#include <stdio.h>
#define N 10
		float average(float array[ ],int M)          
		{
			int i;
			float aver,sum=0;
			for(i=0;i<10;i++)
				sum=sum+array[i];
			aver=sum/M;
			return(aver);
		}
		void main( )
		{
			int i;
			float score[N],aver;
			printf("输入%d个学生的成绩:\n",N);
			for(i=0;i<N;i++)
				scanf("%f",&score[i]);
			aver=average(score,N);                       
			printf("平均成绩是%5.2f\n",aver);
		}
		
		9、三个数由小到大排列。（用单分支if语句编程）
		代码
#include <stdio.h>
		void main( )
		{
			int a,b,c,t;
			scanf("%d,%d,%d",&a,&b,&c);
			if (a>b) {t=a;a=b;b=t; }       
			if (a>c) { t=a;a=c;c=t; }
			if (b>c) { t=b;b=c;c=t; }
			printf("三个数由小到大排列:%d,%d,%d\n",a,b,c);
		}
		
		10、从键盘输入10个整数，并逆序输出。
		代码
#include <stdio.h>
		void main( )
		{
			int i,a[10];
			for(i=0;i<=9;i++)     
				scanf("%d",&a[i]);     
			for(i=9;i>=0;i--)        
				printf("%d ",a[i]);       
			printf("\n");
		}
		11、把100~200之间的不能被9整除的数输出。
		代码
#include <stdio.h>
		void main( )
		{
			int i;
			for (i=100;i<=200;i++)
			{
				if(i%9==0)
					continue;    
				printf ("%d\t",i);
			}
		}
		12、编程序求 3，-30，20，6，77，2，0，-4，-7，99这十个数中最大值与最小值。
		main()
		{
			int a,max,min,m[10]={3,-30,20,6,77,2,0,-4,-7,99};
			max=min=m[0];
			for(a=0;a<10;a++) 
			{
				if(m[a]>max)
					max=m[a]; 
				if(m[a]<min)
					min=m[a]; 
			} 
			printf("%d,%d",max,min);
		}

